"IOConnectionReceptaclePort" = "Port";
"IOConnectionReceptacleSlot" = "Kortplats";
"IOConnectionReceptacleBay"  = "Fack";
"IOConnectionReceptacleJack" = "Jack";

"IOConnectionPositionTop"      = "Högst upp";
"IOConnectionPositionUpper"    = "Övre";
"IOConnectionPositionBottom"   = "Längst ner";
"IOConnectionPositionLower"    = "Nedre";
"IOConnectionPositionLeft"     = "Vänster";
"IOConnectionPositionRight"    = "Höger";
"IOConnectionPositionFront"    = "Framsida";
"IOConnectionPositionBack"     = "Tillbaka";
"IOConnectionPositionExternal" = "Extern";
"IOConnectionPositionInternal" = "Intern";
"IOConnectionPositionBuiltIn"  = "Inbyggd";

"IOConnectionMultipleParents" = "ansluten till flera enheter";

/* Order used to build strings is always: Vendor, DeviceName, DeviceClass,
 * even when some are missing. Ordering numbers must be sequential from 1,
 * because the formatting function can't handle gaps.
 */
"IODescriptionFormatDeviceName"                  = "%1$@";
"IODescriptionFormatDeviceClass"                 = "%1$@";
"IODescriptionFormatVendorDeviceName"            = "%1$@ %2$@";
"IODescriptionFormatVendorDeviceClass"           = "%1$@ %2$@";
"IODescriptionFormatDeviceNameDeviceClass"       = "%1$@ %2$@";
"IODescriptionFormatVendorDeviceNameDeviceClass" = "%1$@ %2$@ %3$@";

/* Order used to build strings is always: Position, Kind, Receptacle, Index,
 * even when some are missing. Ordering numbers must be sequential from 1,
 * because the formatting function can't handle gaps.
 */
"IODescriptionFormatConnectionKind"                        = "%1$@";
"IODescriptionFormatConnectionKindIndex"                   = "%1$@ %2$@";
"IODescriptionFormatConnectionReceptacle"                  = "%1$@";
"IODescriptionFormatConnectionReceptacleIndex"             = "%1$@ %2$@";
"IODescriptionFormatConnectionKindReceptacle"              = "%1$@ %2$@";
"IODescriptionFormatConnectionKindReceptacleIndex"         = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKind"                = "%1$@ %2$@";
"IODescriptionFormatConnectionPositionKindIndex"           = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionReceptacle"          = "%1$@ %2$@";
"IODescriptionFormatConnectionPositionReceptacleIndex"     = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKindReceptacle"      = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKindReceptacleIndex" = "%1$@ %2$@ %3$@ %4$@";

"IODescriptionFormatCombinedNameConnection"      = "%1$@ %2$@";
"IODescriptionFormatCombinedNameMultipleParents" = "%1$@ (%2$@)";

"IODescriptionFormatCombinedMultipleParents" = "enhet ansluten till flera enheter";

"IODescriptionDelimiter" = " -> ";
